# DivideParts Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartUtils..::..DivideParts Method
PartUtils Class See Also
---
Creates divided parts out of parts.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static PartMaker DivideParts(
	Document document,
	ICollection<ElementId> elementIdsToDivide,
	ICollection<ElementId> intersectingReferenceIds,
	IList<Curve> curveArray,
	ElementId sketchPlaneId
)
```

Visual Basic
---
```text
Public Shared Function DivideParts ( _
	document As Document, _
	elementIdsToDivide As ICollection(Of ElementId), _
	intersectingReferenceIds As ICollection(Of ElementId), _
	curveArray As IList(Of Curve), _
	sketchPlaneId As ElementId _
) As PartMaker
```

Visual C++
---
```text
public:
static PartMaker^ DivideParts(
	Document^ document,
	ICollection<ElementId^>^ elementIdsToDivide,
	ICollection<ElementId^>^ intersectingReferenceIds,
	IList<Curve^>^ curveArray,
	ElementId^ sketchPlaneId
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document containing the parts.
elementIdsToDivide
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> The elements that will be divided.
intersectingReferenceIds
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> Intersecting references that will divide the elements.
curveArray
    Type: System.Collections.Generic..::..IList<(Of <(<'Curve>)>)> Array of curves that will divide the elements.
sketchPlaneId
    Type: Autodesk.Revit.DB..::..ElementId SketchPlane id for the curves that divide the elements.
# ### Return Value
The newly created PartMaker. nullNothingnullptra null reference (Nothing in Visual Basic) if no parts are divided.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | One or more element ids was not permitted for dividing parts. Elements should be parts that are not yet divided and maximum distance from an original has not yet been reached. -or- One or more element ids was not permitted as intersecting references. Intersecting references should be levels, grids, or reference planes. -or- The element id should refer to a valid SketchPlane. -or- The input curveArray contains at least one helical curve and is not supported for this operation. -or- The input curveArray contains at least one NULL pointer and is not supported for this operation. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). |
| Autodesk.Revit.Exceptions..::..ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions..::..ModificationOutsideTransactionException | The document has no open transaction. |

# See Also
PartUtils Class
Autodesk.Revit.DB Namespace